# ObjArea

## Description
Function ObjArea returns the area of the referenced object.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION ObjArea(h : HANDLE) : REAL;
```

```python

def vs.ObjArea(h):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Version
Availability: from VectorWorks12.5
## Category
* Object Info